backEnd/app/controllers/apts_controller.rb

INSERT INTO "apartments" ("user_id", "address") VALUES ($1, $2) RETURNING "id"  [["user_id", 1], ["address", "1051 78th Street Brooklyn New York 11228"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
     data = params["id"].split("&")
     apartment = Apartment.create(address: data[0], user_id: data[1])

     user = User.find(data[1])