backEnd/app/controllers/apts_controller.rb

  def show
    apartment = Apartment.find(params["id"])
---
SELECT  "apartments".* FROM "apartments" WHERE "apartments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]