backEnd/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "hihi@hello"], ["LIMIT", 1]]
---
  def create
    user = User.find_by(email: auth_params[:email])