backEnd/app/controllers/users_controller.rb

 def create
   user = User.new(user_params)

   if user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "aaa@bbb"], ["password_digest", "$2a$10$7hp5PGrqwBly9zOvczTh8.bWPEoQfOk882cRn0wibEe.GIhAcrflW"], ["created_at", 2016-12-01 19:35:56 UTC], ["updated_at", 2016-12-01 19:35:56 UTC]]

 def update
   user = User.find(params["id"])
   user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "destination" = $1, "commute" = $2, "schools" = $3, "amenities" = $4, "safety" = $5, "updated_at" = $6 WHERE "users"."id" = $7  [["destination", "5 broadway"], ["commute", 5], ["schools", 2], ["amenities", 10], ["safety", 9], ["updated_at", 2016-12-05 15:31:49 UTC], ["id", 2]]